sim/rhoReactingFoam/5000_3_1e-8/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	// disable legacy to test Sod
	//default         Gauss linear;
	default 	leastSquares;
	grad(U)		cellLimited leastSquares 1;
}

divSchemes
{
    	default         none;

	// disable legacy to test Sod
    	//div(phi,U)      Gauss limitedLinearV 1;
	div(phi,U)	Gauss MinmodV;
    	div(phi,Yi_h)   Gauss limitedLinear 1;
    	div(phi,K)      Gauss limitedLinear 1;
    	div(phid,p)     Gauss limitedLinear 1;
    	div(phi,epsilon) Gauss limitedLinear 1;
    	div(phi,k) Gauss limitedLinear 1;
    	div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    	//default         Gauss linear orthogonal;
	default		Gauss linear limited 1;
}

interpolationSchemes
{
    	default         linear;
}

snGradSchemes
{
    	//default         orthogonal;
	default limited 1;
}


// ************************************************************************* //
